[
  {
    "title": "PCT Day 2-8",
    "datetime": "2024-07-13T18:21:00-07:00",
    "body": "Trip #2 Complete! It required a 25 mile day with a 17 mile water carry but we did it. Now my feet are sore and blistered but I have an ice cold diet coke and am heading home."
  },
  {
    "title": "PCT Day 2-7",
    "datetime": "2024-07-12T20:18:00-07:00",
    "body": "18.5mi today; bugs were terrible in morning but calm the second half. Found nice campsite with few bugs! 24 miles from the finish line @ HWY 138; one final push to the end."
  },
  {
    "title": "PCT Day 2-6",
    "datetime": "2024-07-11T20:42:00-07:00",
    "body": "Back on the trail and so are the mosquitos but now we are supplied with bug spray and bug nets. Camped at Summit Lake with the worst mosquitos of the trip thus far."
  },
  {
    "title": "PCT Day 2-5",
    "datetime": "2024-07-10T20:42:00-07:00",
    "body": "Quick 14 miles to shelter cove and took the rest of the day recovering and resupplying."
  },
  {
    "title": "PCT Day 2-4",
    "datetime": "2024-07-09T16:20:00-07:00",
    "body": "20 miles today. Met a new best friend (Snoozy) who's now joining us the rest of the trip. Bugs were brutal again; no deet can keep 'em away."
  },
  {
    "title": "PCT Day 2-3",
    "datetime": "2024-07-08T20:42:00-07:00",
    "body": "Another 19 mi. Hot but no snow. Picked up bug spray at Elk Lake and that made a huge difference. Still lots of skeets but staying off face/hands."
  },
  {
    "title": "PCT Day 2-2",
    "datetime": "2024-07-07T20:50:00-07:00",
    "body": "19 miles of battling mosquitos, heat, and melting snow. Not exaggerating: worst bugs I've seen in my life. Hopefully getting some deet tomorrow."
  },
  {
    "title": "PCT Day 2-1",
    "datetime": "2024-07-06T22:42:00-07:00",
    "body": "Day 1 complete! Finished 7.5 miles before setting up camp. Bugs were super bad. Looking to get a good night sleep and excited to hop back on the trail tomorrow."
  },
  {
    "title": "PCT Day 1-29 Final Update",
    "datetime": "2023-09-19T18:40:00-07:00",
    "body": "Done"
  },
  {
    "title": "PCT Day 1-29",
    "datetime": "2023-09-19T11:06:00-07:00",
    "body": "AM Update: I can't believe it's my last morning. After a month of hiking every day, I have less than 7 miles to go. I was able to arrange a ride with a trail angel who will give me a ride to Bend where I'll meet my Mom."
  },
  {
    "title": "PCT Day 1-28",
    "datetime": "2023-09-19T11:06:00-07:00",
    "body": "AM Update: great quiet night and a pretty good sunrise too. I'm 20 miles from a quick stop for laundry and shower at a summer camp with a PCT hiker lounge then just 10 more miles to the finish!\nPM Update: did laundry, showered, and set up camp for the night. Only 8 miles left on this summer's journey."
  },
  {
    "title": "PCT Day 1-27",
    "datetime": "2023-09-17T19:23:00-07:00",
    "body": "AM Update: Last night was super windy; kept waking up in the middle of the night from my tent being blown around. This morning has been really windy as well; my Garmin says today will be 15-20mph winds. Fortunately I got a break from the blaze and some amazing views of Mt. Jefferson. Linking photos below.\nPM Update: continued to be windy throughout most of the day but I found the most beautiful campsite on a lake tucked in between some strong trees and it appears to be all but completely protected from the wind. I was going to hike another 4 miles but I couldn't say no to this camp site on my second to last night."
  },
  {
    "title": "PCT Day 1-26",
    "datetime": "2023-09-17T19:18:00-07:00",
    "body": "AM Update: had a good night sleep and had fun helping out with packet pickup at the race this morning. Kjersti is on her way with my resupply box and a new set or trekking poles!\nPM Update: Made it about 9 miles before setting up camp next to a lake; today was a slog through a previous wild fire. Looks like it's going to be a windy night."
  },
  {
    "title": "PCT Day 1-25",
    "datetime": "2023-09-16T10:08:00-07:00",
    "body": "Friday Update: Made it to Ollallie Lake Resort and finished off my hot meals. The Mountain Lakes 100 Ultramarathon happens to also be going on right now so I'm helping out where I can. I'm going to volunteer with the race in morning while waiting for KJ."
  },
  {
    "title": "PCT Day 1-24",
    "datetime": "2023-09-16T10:06:00-07:00",
    "body": "AM Update: trucks from the nearby road were a bit annoying but it was a clear night and I saw a bunch of shooting starts and satttelites. ✨ Afternoon Update: Unfortunately someone decided to steal my trekking poles while I briefly stepped off trail to pee and take some photos of Timothy Lake. I'm guessing they assumed someone left them behind and thought they were being helpful by bringing them to a trailhead. I ran into some course markers for the Mountain Lakes 100 and they said they'll bring the poles to the start line at Ollallie Lake Saturday if they find them at a trailhead or someone with a suspicious extra pair of poles. Annoying, but hopefully won't need them until I see Kjersti Saturday.\nPM Update: pretty good day other than the poles. I'm 18ish miles from Ollallie Lake where there's a little store and I'll meet Kjersti for my last resupply!"
  },
  {
    "title": "PCT Day 1-23",
    "datetime": "2023-09-14T08:17:00-07:00",
    "body": "Post office doesn't open until noon so I'm going to get a late start today.\n1:15 update: back on the trail\nPM Update: got about 11 miles in today. Looking forward to fill day of hiking tomorrow."
  },
  {
    "title": "PCT Day 1-22",
    "datetime": "2023-09-12T20:29:00-07:00",
    "body": "AM Update: stayed in bed late today waiting for the rain to die down; getting a late start but the weather is supposed to clear up later so hopefully I can try out my tent around lunch.\nPM Update: Sun came out and it ended up being s hot day with great views of Mount Hood. Posted my longest day of trip with 24 miles and ended at the Timberline Lodge. From there I took a bus down to Government CAMP, OR where I can do laundry and pickup my resupply box from the post office."
  },
  {
    "title": "PCT Day 1-21",
    "datetime": "2023-09-11T20:14:00-07:00",
    "body": "Got a nice cup of coffee and some avacado toast for breakfast while I wait for the post office to open. After talking to multiple people I've decided to do the PCT Eagle Creek Alternate (added to my map) up to Indian Springs where I'll rejoin the main trail. From there it's an easy 36 miles to my next resupply at Government Camp.\nHad a great hike through/past all the waterfalls of Eagle Creek! Definitely glad I chose that route. Knocked out a little over 21 miles today and looking forward to all the flat terrain ahead!"
  },
  {
    "title": "Rest Day",
    "datetime": "2023-09-10T09:40:00-07:00",
    "body": "Post Office is closed on the weekends so I'm taking the day off in Cascade Locks while I wait to pickup my resupply package tomorrow."
  },
  {
    "title": "PCT Day 1-20",
    "datetime": "2023-09-09T20:19:00-07:00",
    "body": "AM Update: getting a good start to the day.\n8:30 AM: just finished my 300th mile.\nNoon: We can see Cascade Locks off in the distance. About 10 miles to go.\n4:45 PM: Made it to the Bridge of the Gods and Oregon! Had a great lunch at Thunder Mountain Brewing and took a hot shower. Looking forward to a zero day tomorrow."
  },
  {
    "title": "PCT Day 1-19",
    "datetime": "2023-09-09T11:58:00-07:00",
    "body": "Am update: got a good night sleep and looking forward to a lighter day. Weather is supposed to be beautiful.\nPM Update: JohnMichael and I are 19 miles shy of Cascade Locks and the end of Section H! Found great campsite by the river."
  },
  {
    "title": "PCT Day 1-18",
    "datetime": "2023-09-07T18:35:00-07:00",
    "body": "Thursday Update: found a great campsite near Panther Creek. Might even make it into Cascades Locks early"
  },
  {
    "title": "PCT Day 1-17",
    "datetime": "2023-09-06T18:52:00-07:00",
    "body": "AM Update: good night sleep and getting a decent start to the morning. Aiming for 15 but we'll see how far we make it.\nPM Update: probably easiest day of trails yet; super gentle inclines with lots of Downhill. JohnMichael crushed it today so we hope his feet are feelin' good in the morning."
  },
  {
    "title": "PCT Day 1-16",
    "datetime": "2023-09-05T19:56:00-07:00",
    "body": "Tuesday update: had a nice breakfast/lunch in town then joined cousin JohnMichael in tge afternoon and got on the trail around 2pm. Easy 10 miles to start and we found a lovely campsite."
  },
  {
    "title": "PCT Day 1-15",
    "datetime": "2023-09-04T08:39:00-07:00",
    "body": "AM Update: we got to bed really early and I slept great; it only rained a little in the morning but enough to soak my rain fly. Got an early start to the day (on the trail at 6:35); it's a cold one so far.\nPM Update: made it on the last shuttle and in to town in time for dinner and laundry. Still trying to dry out my tent but hopefully it will be dry by morning. Weather looks like it should be clear the next 10 days (but it also said that about last week)."
  },
  {
    "title": "PCT Day 1-14",
    "datetime": "2023-09-03T19:45:00-07:00",
    "body": "AM Update: Forecast said 0% chance of rain so naturally it started raining at 4am. We made it on the trail by 7:45.\nPM Update: much more manegable today; the views were admittedly less impressive but the trail way easier. 18 miles until Trout Lake. Last shuttle from the trail to town is at 4:30pm so we're starting early tomorrow."
  },
  {
    "title": "PCT Day 1-13",
    "datetime": "2023-09-02T20:30:00-07:00",
    "body": "AM Update: got a late start but in the trail around 8:30. Excited for Goat Rocks!\nPM Update: long hard day; definitely the steepest stretch of trail yet but the views were incredible! Weather really cleared up for us today as well. Going to try and get started early tomorrow."
  },
  {
    "title": "PCT Day 1-12",
    "datetime": "2023-09-01T20:19:00-07:00",
    "body": "Woke up early to wash clothes and take a shower at the Kracker Barrel. Morning was damp hit I was able to dry out most of tlmy things over night. My friend Marija is joining me this morning through Trout Lake and it was great hiking with her today!"
  },
  {
    "title": "PCT Day 1-11",
    "datetime": "2023-08-31T06:56:00-07:00",
    "body": "AM Update: Forecast said no rain: it rained all night. New forecast says rain all day. Getting a late start today.\nAfternoon Update: The downpour has started. There is not escaping this rain. Going to be drenched when I get to White Pass.\nPM Update: Made it to white pass around 3:45 and had a few hot meals (3). Resupply box has been acquired so now I can take the night to dry out my stuff and do laundry. Excited for Marija to join tomorrow!"
  },
  {
    "title": "PCT Day 1-10",
    "datetime": "2023-08-30T10:17:00-07:00",
    "body": "Afternoon Update: back on the trail! Had a lovely break and meal with my grandparents driving out to see me and now I have a short 9 mile day ahead.\n2PM Update: weather cleared and should be nice rest of day. Going to start raining in afternoon tomorrow so i'm going to try and get more miles in today.\nPM Update: setup camp near the crag lake outlet stream; got in bed early and did a crossword puzzle. 16 miles from white pass."
  },
  {
    "title": "PCT Day 1-9",
    "datetime": "2023-08-29T07:16:00-07:00",
    "body": "AM Update: rainsed last night but everything stayed dry. About 40° colder today. On the move by 7:15.\nPM Update: great to head into town, get a hot meal, and take a shower. Light couple days ahead before White Pass Friday!"
  },
  {
    "title": "PCT Day 1-8",
    "datetime": "2023-08-28T17:45:00-07:00",
    "body": "AM Update: slept great last night, looking to do a nice easy 17 today it's going to be hot and hilly.\nPM Update: Needed shorter day after yesterday; found nice campsite at 17. Supposed to start ⛈ at 4am and not stop but I'm only 13 miles from Chinook Pass!"
  },
  {
    "title": "PCT Day 1-7",
    "datetime": "2023-08-27T21:00:00-07:00",
    "body": "AM: Campsite wasn't great but did the job . Water is scarce on this leg so I'm going to have to carry an extra couple of liters all day. It's gonna be a long and hot one. Getting an early start and going to try and take a nice long lunch break. Probably won't have cell service again until Tuesday. Hopefully today will be a little bit more photogenic. Took a nice lunch break by the spring at my halfway point. Talked to some guys from new Zealand. It's getting hot out. This spring is 102 miles south of my starting point; that's 20% complete of my goal.\nPM Update: long long day. 21 miles with 5,300 up and 4,100; I think that makes it my highest elevation day so far. Was getting a bit discouraged from the heat and exhaustion but I eventually made it to a really nice flat campsite. Saw some Elk climbing over the hill while I was cooking dinner. I'm 30 miles from Chinook Pass and a nice break."
  },
  {
    "title": "PCT Day 1-6",
    "datetime": "2023-08-26T19:05:00-07:00",
    "body": "Had a great night at the Washington Alpine Club lodge. Got going early this morning then was very distracted by all the blueberry bushes. New water filter is amazing (thanks Joe) and is saving me an hour of filter time. No more marmots or pika but I did see two snakes and a large toad. Feet really started to feel the mileage today; I'm worried yesterday's rest day gave them false hope. Camp's been set up since 4:30 and I'm just waiting for the sun to set so I can fall asleep."
  },
  {
    "title": "PCT Day 1-5",
    "datetime": "2023-08-25T15:16:00-07:00",
    "body": "AM Update: really windy last night; woke me up sporadically. Fortunately I'm only 7 miles from Snoqualmie and will get a true rest day. 11am: I made it to civilization! The Washington Alpine Club has a lodge with showers and laundry so I'll be taking the rest of the day off to enjoy that 😊"
  },
  {
    "title": "PCT Day 1-4",
    "datetime": "2023-08-25T15:19:00-07:00",
    "body": "AM Update: great campsite; plenty warm. The pika's like to stay up late and wake up early 😂 Aiming for huckleberry mountain today (15-16 mi). Took me a little over an hour to get hiking from wake up. Hoping to get that time down.\nPM Update: ended up hiking 20.5 miles because my preferred water sources dried up 🙃. Got camp set up and dinner cooked before dark; but just barely."
  },
  {
    "title": "PCT Day 1-3",
    "datetime": "2023-08-25T15:13:00-07:00",
    "body": "AM Update: rained all night. Was about to keep self and gear dry but ground is soaked. Going to try and do a lighter day today.\n8AM Update: Just had a scare one mile into my hike where I thought i was going the wrong way; things looked too familiar. it's fine, i'm going the right way 😂\nPM Update: Another big day on the trail; 16 miles with 3,300 ft of gain and 2,200 loss. Supposed to be dry tonight but it smells like the smoke might be coming in. Found a beautiful campsite with views of at least 9 different glaciers. Today was tough but manageable. Feet doing better today; they better get used to this."
  },
  {
    "title": "PCT Day 1-2",
    "datetime": "2023-08-25T15:11:00-07:00",
    "body": "AM Update: slept amazing. Going to try and make it to Spinola Creek or Waptus Lake if feeling ambitious. Should be a lot cooler today.\nPM Update. Smoke is gone! Unfortunately it might rain in the morning 🙃 Today was HARD; 16 miles in 8hrs with 3.3k ft up and 3.8k down. Already in bed. Night!"
  },
  {
    "title": "PCT Day 1-1",
    "datetime": "2023-08-21T05:34:00-07:00",
    "body": "This morning my cousin Lauren and I are starting the trail at Steven's pass and hiking south for the day. Tomorrow morning Lauren will turn around and head back to Stevens while I'll continue south. Super stoked to start this journey!\nEOD update. Smoke starting to clear up; can't taste it anymore. Saw 4 marmots, a badger, countless pika. Possibly a bear. Hiked 14 miles to glacier lake."
  },
  {
    "title": "New Plans Set",
    "datetime": "2023-08-17T16:06:00-07:00",
    "body": "Had to reset all plans and boxes but I have my new plan set. Start: Steven's Pass, WA End: Mckenzie Pass, OR Distance: 480 miles Time: 28 days Mailed supply boxes: 6 Excited to head off Monday!"
  },
  {
    "title": "Fires — Oops",
    "datetime": "2023-08-16T15:00:00-07:00",
    "body": "Forest fires have officially closed the trail north of Stehekin. Although I could technically start in Stehekin, the logistics of getting there are really complicated and there are a couple other small fires in the area so now the plan is to start at Stevens Pass and hike south; hopefully being able to come back and hike the northern section at the tail end of my trip. The good news is that there doesn't appear to be any other fires near or threatening the trail but I will always be on the lookout. I will update my schedule accordingly. PCT Forest Fire Map"
  },
  {
    "title": "Less Than a Week!",
    "datetime": "2023-08-15T15:56:00-07:00",
    "body": "My plans are set, resupply boxes packed, and all I have left to do is start hiking! I'll mail out the last 3 boxes before I leave so they won't have to sit too long at their destinations before I pick them up. Super stoked to get started and looking forward to sharing the journey with you. I set up this blog where I should be able to send 160 character updates through my Garmin inReach throughout the day. Hopefully I'll be able to edit/format them nicely when I find cell service/wifi throughout the trip. I'll also post photos to the feed at that point. Thanks for following along!"
  },
  {
    "title": "Milly the Kitty Cat",
    "datetime": "2023-08-14T23:51:00-07:00",
    "body": "Milly said she didn't want to come hiking with me so I'll have to leave her at home :( Missing you kitten!"
  }
]